[
  {
    "name": "ООО \"ИОТ\"",
    "description": "Разработка модов и плагинов для Minecraft под платформы: FabricMC, Velocity.\n\nБольшая часть разработки велась под NDA.",
    "post": "Java-разработчик",
    "time": "октябрь 2024 - настоящее время",
    "asset": "mindcube.webp",
    "url": "https://mindcube.ru/"
  },
  {
    "name": "ООО \"АЕЗА ГРУПП\"",
    "description": "Разработка API под Java, Typescript для работы с мерчант-платформами: PayMaster, Lava. Это позволило более удобно использовать возможности платформ в коде;\n\nВыстраивание микросервисной архитектурой на фреймворке Spring.\nОдин из ярких примеров - применение собственно разработанного API для обработки онлайн-платежей и последующего внесения изменения в данные пользователя. С помощью этого пользователи в кратчайшее время получали приобретенный ими товар;\n\nРазработка дизайна лендинга и его верстка.\nЯ выполнял экстренную задачу: в сжатые сроки подготовить дизайн лендинга с его адаптивным отображением в Figma, после чего сверстать его на стеке React и SCSS (Typescript). Моя работа получилась менее нагруженной для браузера клиента, приятнее глазу и с более чистым кодом, в сравнении с тем, что было до этого.\n\nКлючевые слова: Java, Javascript, Typescript, NodeJS, React, SCSS, Merchant, Мерчант, API, Spring Boot, Figma, PaperMC, Git",
    "post": "Fullstack-разработчик",
    "time": "июль 2024 - настоящее время",
    "asset": "aeza.webp",
    "url": "https://aeza.me/"
  },
  {
    "name": "CyberMP",
    "description": "CyberMP - это проект по воссозданию сетевой игры и в то же платформа для игровых серверов Cyberpunk 2077.\n\nЯ являлся главным дизайнером, разработавшим логотип проекта, дизайн лендинга и менеджера серверов.\n\nЗанимался Frontend-разработкой лендинга и менеджером серверов на React с использованием TailwindCSS, SCSS, MobX и I18Next.\n\nРуководил Backend-разработкой на платформе NestJS:\n- Занимался разработкой микросервисной архитектурой, связанной с помощью gRPC и Protobuf;\n- Работал с базой данных PostgreSQL через TypeORM;\n- Создал контроллеры для того, чтобы обновлять и брать данные пользователя или сервера;\n- Разработал систему авторизации в менеджере серверов через Discord OAuth2 с использованием JWT-токенов;\n- Разработал Discord-бота, помогающего составу в модерации чатов.\n\nВся разработка происходила в команде, работая через GitHub.\n\nКлючевые слова: React, TailwindCSS, SCSS, CSS, MobX, NodeJS, NestJS, JWT, Discord, OAuth2, Guard, PostgreSQL, ORM, SQL, gRPC, Protobuf, Javascript, Typescript, Figma, Git",
    "post": "Web-разработчик",
    "time": "май 2024 - настоящее время",
    "asset": "cybermp.webp",
    "url": "https://cybermp.org/"
  },
  {
    "name": "AlechkaVT",
    "description": "Отвечал за техническую часть сервера Minecraft: создание и установка сборки, поддержание работоспособности сервера.\n\nЗанимался разработкой модофикаций на платформе Forge специально под сервер и стримера.",
    "post": "Технический админ",
    "time": "июнь 2024 - декабрь 2024",
    "asset": "alechkavt.webp",
    "url": "https://twitch.tv/alechkavt"
  },
  {
    "name": "Аура",
    "description": "Сервер Minecraft, завязанный на взаимодействие между стримерами.\nЭто проект с кучей интерактивных вещей для стримеров.\nЗдесь был разработан микросервис на Spring, настроена интеграция с Twitch API, и все это соединено с Minecraft-сервером. Сначала разработка шла под PaperMC, потом под Forge.",
    "post": "Владелец",
    "time": "март 2024 - июнь 2024",
    "asset": "aura.webp"
  },
  {
    "name": "Aniby.NET (v3)",
    "description": "Как раз-таки этот сайт, который вы и можете наблюдать.\n\nДизайн был воплощен в Figma с нуля.\nLegacy-верстка на чистом HTML, CSS, JS.\n\nВторая версия сайта ушла в небытие.",
    "post": "Создатель",
    "time": "10 - 11 января 2025",
    "asset": "aniby.webp",
    "url": "https://github.com/an1by/aniby.net/"
  },
  {
    "name": "Aniby.NET (v1)",
    "description": "Сайт, который располагался на домене aniby.net до этого.\nПервоначальный дизайн был выполнен в Figma человеком с никнеймом Marquis. На этапе верстки были внесены существенные изменения лично мной.\n\nСверстано на TypeScript с использованием React, TailwindCSS.\nБыл заменен после совершенстования своих навыков.",
    "post": "Создатель",
    "time": "около недели неспешной работы",
    "asset": "anibyold.webp",
    "url": "https://github.com/an1by/aniby.net/tree/v1"
  }
]
